Revit 2027 API
BuiltInFailures.JoinElementsFailures.CannotKeepReferenceOfJoinedElementWarning Property
 Can't keep reference of joined element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotKeepReferenceOfJoinedElementWarning { get; }
Public Shared ReadOnly Property CannotKeepReferenceOfJoinedElementWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotKeepReferenceOfJoinedElementWarning {
	FailureDefinitionId^ get ();
}
static member CannotKeepReferenceOfJoinedElementWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace